Revit 2027 API
ParameterTypeId.CouplerLength Property
 "Total Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CouplerLength { get; }
Public Shared ReadOnly Property CouplerLength As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CouplerLength {
	ForgeTypeId^ get ();
}
static member CouplerLength : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace